#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# (c) @AlbertEinsteinTG | @Hillard_Har 

class Translation(object):
    
    START_TEXT = """
😅 ဝေး {}, 

ကျွန်ုပ်ကတော့အော်တို Filter ဘော့ကိုအဆင့်မြင့်သောလုပ်ဆောင်ချက်များနှင့်
 သူ့အတွက်အလုပ်လုပ်နေတာပါ။ @{} 

⚜️ တီထွင်ဖန်တီးသူ 👉 @{}
"""   
    
    HELP_TEXT = """
<u>💡 အကူအညီ</u>

<i>
📌 ငါ့ကို ကြိုက်တဲ့ ဂရုကိုထည့် ပီးရင် အက်တမင် ပေး
📌 ပီးတော့ သင်လိုချင်တဲ့ ချယ်နယ် ကိုလဲထည့်
</i>

<b>🔰 ငါ့အမိန့်များ (ဒီ အမိန့်မှန်သမျှ ဂရုမှာပဲ လုပ်တာနော်) :</b>

    👉 <code>/add chat_id</code>
                OR                  - ဂရုနဲ့ ချယ်နယ် ချိတ်ဖို အတွက် ဒီ အမိန့်ကို သုံးရမယ် (အက်တမင်က နှစ်နေရာလုံးပေးနော်)
     <code>/add @Username</code>
     
    👉 <code>/del chat_id</code>
                OR                  - ချယ်နယ်နဲ့ ဂရုချိတ်တာကို ဖြုတ်ဖို
     <code>/del @Username</code>
     
    👉 <code>/delall</code>  - ချယ်နယ်ရော ဂရုရော မှတ်ညဏ်ထဲသိမ်းထားသမျှ ဖိုင်တွေအကုန်ဖျက်ဖို ဒါကိုသုံးရမယ်
    
    👉 <code>/settings</code> - ဆက်တင်ချိန်ဖို ခလုပ်တွေ ကြည့်ဖို ဒါနှိပ်ရမယ်

🔰 ဆက်တင်ချိန်ဖို ခလုပ်တွေ

            👉 <code>Channel</code> - ယခုဂရုနဲ့ ချယ်နယ် ဘယ်လောက်ချိတ်ထားသလဲ ဆိုတာပြမယ့်အပြင် သက်ဆိုင်ရာချယ်နယ်တစ်ခုချင်းဆီအလိုက် နံပါတ်စဥ်လိုက်ခလုပ်များနှင်ပြသပေးမယ်။ထိုပြင် ယာယီဖြုတ်မယ်/ပြန်ချိတ်မည်(ချယ်နယ်) တိုကိုလည်းပြုလုပ်နိုင်သည်။
            
            👉 <code>Filter Types</code> - ဘော့ရဲ့ အလုပ်လုပ်မယ် အပိုင်းပါ။ သွားမကလိပါနဲ့။အော်တိုင်းပဲထားပါ။

            👉 <code>Configure</code> - စုစုပေါင်း အဖြေစာမျက်နှာ၊တစ်မျက်နှာမှာပြမယ်ခလုပ်အရေအတွက်၊ ပီးတော့ အင်ဗိုက်လင့်ထုတ်ပေး/မပေး၊ ထိုပြင် ပါစင်နယ်ကနေပို/မပို။ စသည်တိုကို ဘော့ရီစတက် မလုပ်ရဘဲနဲ့ ချက်ချင်းပြောင်း လဲနိုင်သည်။ Results
            
            👉 <code>Status</code> - ဒါကတော့ ချိတ်ထားတဲ့ ချယ်နယ်နဲ့ စုစုပေါင်းဘယ်လောက်ရှိတယ် ဘာညာ ကိုပြပေးတာပေါ့။(မသိလဲရပါတယ်)
            
<b><a href="https://t.me/allserieslinkchnel_rainbow">©️ Rainbow_CH</a></b>
"""
    
    ABOUT_TEXT = """
📕 �ကျွန်ုပ် အကြောင်း ,
\n○ ကျွန်ုပ် နာမည် : {}

○ ဘာသာ : ᴘʏᴛʜᴏɴ 

○ ဖွဲစည်းမှု : ᴘʏʀᴏɢʀᴀᴍ 

○ ဆာဗာ : ʜᴇʀᴏᴋᴜ 

○ ဗားရှင်း : 1.0.0

○ ပင်ရင်းကုတ် : [ᴄʟɪᴄᴋ ʜᴇʀᴇ 🥰](https://t.me/kopaing15)

○ ဖိုးစိတ်ဖြူ : [@N_A_S](https://t.me/nas0055)

**မြန်မာစံတော်ချိန် ည ၁၁နာရီ ၂၃မိနစ် ဒီဇင်ဘာ ၁၇ရက်နေ့တွင် အဆင်မြှင့်ထားခဲ့သည်**

**[©Rainbow_CH](https://t.me/allserieslinkchnel_rainbow)**
"""
